app/views/shared/_comment_box.html.erb

<% @comments = Comment.where(post_id: post.id) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 LIMIT $2  [["post_id", 1], ["LIMIT", 0]]

        <% @comments.limit(limit).each do |comment| %>
        <% user = User.find(comment.author_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]