app/views/posts/index.html.erb

    </div>
      <%= render "shared/comment_box", comments: post.comments.last(5) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" IN ($1, $2, $3, $4, $5) ORDER BY "comments"."created_at" DESC  [["post_id", 6], ["post_id", 1], ["post_id", 2], ["post_id", 4], ["post_id", 3]]