app/controllers/comments_controller.rb

INSERT INTO "comments" ("text", "post_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Hello This is my new comment"], ["post_id", 7], ["author_id", 2], ["created_at", "2023-08-25 22:14:12.657391"], ["updated_at", "2023-08-25 22:14:12.657391"]]
---
  def create
    @comment = @post.comments.new(comment_params)
    @comment.author = current_user
    if @comment.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def set_user_post
    @user = User.find(params[:user_id])