app/controllers/posts_controller.rb

  def index
    @page_title = 'Post Index Page'
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def show
    @page_title = 'Post Show Page'
    @user = User.find(params[:user_id])
    @post = Post.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @post = current_user.posts.new(post_params)
    if @post.save
---
INSERT INTO "posts" ("title", "text", "author_id", "created_at", "updated_at", "comments_count", "likes_count") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def like
    @user = User.find(params[:user_id])
    @post = @user.posts.find(params[:id])
    @like = @post.likes.create(author: current_user)
    @like.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("author_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["post_id", 3], ["created_at", "2023-08-31 21:15:25.601717"], ["updated_at", "2023-08-31 21:15:25.601717"]]
UPDATE "users" SET "posts_count" = COALESCE("posts_count", 0) + $1 WHERE "users"."id" = $2  [["posts_count", 1], ["id", 1]]
UPDATE "posts" SET "likes_count" = COALESCE("likes_count", 0) + $1 WHERE "posts"."id" = $2  [["likes_count", 1], ["id", 3]]

  def set_user
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]