app/controllers/users_controller.rb

  def index
    @page_title = 'User Index Page'
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @page_title = 'User Show Page'
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]