app/models/post.rb

  def update_author_posts_count
    author.update(posts_count: author.posts.count)
---
SELECT COUNT(*) FROM "posts" WHERE "posts"."author_id" = $1  [["author_id", 1]]